src/test/resources/XCPD/XCPDPatientLocationQueryRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
<s:Header>
<a:Action s:mustUnderstand="1">urn:ihe:iti:2009:PatientLocationQuery</a:Action>
<a:MessageID>urn:uuid:a02ca8cd-86fa-4afc-a27c-16c183b2055</a:MessageID>
<a:ReplyTo>
  <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
</a:ReplyTo>
<a:To s:mustUnderstand="1">http://localhost:2647/Service/IHERespondingGateway.svc</a:To>
</s:Header>
  <s:Body>
<xcpd:PatientLocationQueryRequest xmlns:xcpd="urn:ihe:iti:xcpd:2009    
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
      xsi:schemaLocation="urn:ihe:iti:xcpd:2009>
  <xcpd:RequestedPatientId root="1.2.840.114350.1.13.99997.2.3412" extension="38273N237"/>
</xcpd:PatientLocationQueryRequest>        
</s:Body>
</s:Envelope>
